Revit 2024 API
Category.Parent Property
Returns the parent category of this category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Category Parent { get; }
Visual Basic
Public ReadOnly Property Parent As Category
	Get
Visual C++
public:
property Category^ Parent {
	Category^ get ();
}
Return Value
null if this category a not a subcategory
See Also
Category Class
Autodesk.Revit.DB Namespace